{
    "code": {
        "url": "https://github.com/bevacqua/buildfirst",
        "title": "Code Samples and Snippets",
        "description": "Every single code sample and snippet that is discussed in the book, and then _a few more_, which didn't make it into the book."
    },
    "speed-matters": {
        "url": "http://www.codinghorror.com/blog/2006/11/speed-still-matters.html",
        "title": "Speed Still Matters",
        "description": "In this blog post, renowned Jeff Atwood, of [Stack Overflow](http://stackoverflow.com \"Stack Overflow Q&A Site\") fame, goes over anecdotes about how Google and Amazon tested their sites' perceived speed, and the interesting conclusions they arrived at."
    },
    "grunt": {
        "url": "http://gruntjs.com",
        "title": "Grunt Task Runner",
        "description": "Grunt is a task runner that helps us automate our build process. It is thoroughly discussed in the book."
    },
    "db-tasks": {
        "url": "https://github.com/bevacqua/buildfirst/tree/master/ch02/09_mysql-tasks",
        "title": "Case Study: Database Tasks",
        "description": "In this particular code sample, we'll create a series of database-related tasks for our build process. These will help us bootstrap environments, as well as reduce the complexity in database schema updates and rollbacks."
    },
    "secure-config": {
        "url": "https://github.com/bevacqua/buildfirst/tree/master/ch03/02_rsa-config-encryption",
        "title": "RSA Secure Configuration",
        "description": "Chapter 3 is all about environments in general and the development environment in particular. In this example, we'll learn how to keep our configuration safe by encrypting it with an RSA key. Full details are available following the link."
    },
    "12factor": {
        "url": "http://12factor.net",
        "title": "The Twelve-Factor App",
        "description": "One of Heroku's co-founders wrote this extensive document detailing their approach to application architecture, configuration, scaling, and deployment. This is a read I could not recommend more often."
    },
    "heroku-cli": {
        "url": "https://devcenter.heroku.com/articles/config-vars",
        "title": "Heroku CLI",
        "description": "Heroku is a cloud hosting [**PaaS**](http://en.wikipedia.org/wiki/Platform_as_a_service) (platform-as-a-service) provider that allows us to easily deploy applications directly through `git`. In this article, you'll find details on how to configure your hosted environment directly from the command-line."
    },
    "watch-out": {
        "url": "https://github.com/bevacqua/buildfirst/tree/master/ch03/05_better-watch-closely",
        "title": "Watch out!",
        "description": "After learning about Grunt, and the kind of tasks you can automate with it, we'll examine **continuous development**. The first step in that direction is using a Grunt `watch`, to monitor file changes and have tasks re-executed automatically for us. This is the sample code for the `watch` task."
    },
    "livereload": {
        "url": "https://github.com/bevacqua/buildfirst/tree/master/ch03/07_livereload",
        "title": "LiveReload",
        "description": "This technology enables our browser to refresh itself whenever a file changes. If the browser doesn't really need to perform a full page reload, then it will only get what changed (through [Web Sockets](http://www.html5rocks.com/en/tutorials/websockets/basics/)) and then apply that to your page, making it even faster. This example shows how to get it up and running."
    }
}
